# **İleri Toplulaştırma İşlemleri(Aggregate, filter, transform, apply)**

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

### aggregate(bağlama)

In [8]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [9]:
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [11]:
df.groupby("gruplar").aggregate({"degisken1":"min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

### filter

In [12]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [13]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [15]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [16]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

### transform

In [19]:
df.transform(lambda x: x-x.mean())

C:\Users\Acer\AppData\Local\Temp\ipykernel_11788\2502592658.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.transform(lambda x: x-x.mean())

   degisken1  degisken2 gruplar
0      -23.0     -238.0     NaN
1      -10.0      -85.0     NaN
2        0.0       -5.0     NaN
3      -11.0      -76.0     NaN
4      -22.0     -227.0     NaN
5       66.0      631.0     NaN

In [20]:
 #mean() ortalama alma

In [21]:
df_a = df.iloc[:,1:3]

In [26]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

### apply

In [44]:
df1 = pd.DataFrame({'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                  columns = ['degisken1','degisken2'])
df1

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [45]:
df1.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [46]:
df1.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [48]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302